import { makeStyles } from "@material-ui/core/styles";
import NavBar from "../components/NavBar";
import { useEffect } from "react";
import grow from "../img/grow.png";
import mmigrow from "../img/mmigrow.png"
import bms from "../img/bms.png"
import growgarph from "../img/growgraph.jpg"
import wmm from "../img/wmm.jpg"
import { TextField, Button, Grid, Hidden } from "@material-ui/core";
import Table from '@material-ui/core/Table';
import TableBody from '@material-ui/core/TableBody';
import TableCell from '@material-ui/core/TableCell';
import TableContainer from '@material-ui/core/TableContainer';
import TableHead from '@material-ui/core/TableHead';
import TableRow from '@material-ui/core/TableRow';
import Paper from '@material-ui/core/Paper';
import backgroundImage from '../img/background polygon.png'
const useStyles = makeStyles((theme) => ({
  container: {
    padding: 60,
    background: `url('${backgroundImage}')`,
    backgroundColor: 'white'
  },
  headText: {
    fontSize: "2em",
    display: "inline-block",
  },
  subheadText: {
    fontSize: "1.5em",
    display: "inline-block",
  },
}));

const About = () => {
  const classes = useStyles();
  useEffect(() => {
    window.scrollTo(0, 0);
  }, []);
  return (
    <>
      <NavBar />
      <div className={classes.container}>
        <Grid item xs={12} md={6} style={{ margin: "1em" }}>
          <div className={classes.headText}>คำนำ</div>
          <p>
            โรงเรียนทุกแห่งจะมีการเฝ้าระวังและติดตามสุขภาพทางกายของเด็กนักเรียนเป็นประจำทุกปี
            โดยอาศัยการชั่งน้ำหนักตัว วัดส่วนสูง และคำนวณเป็นค่าดัชนีมวลกาย
            หรือน้ำหนักตัวที่ปรับด้วยค่าความสูง
            เพื่อใช้บ่งบอกถึงระดับการเจริญเติบโตและสภาวะโภชนาการของเด็กแต่ละคน
            น้ำหนักตัว ส่วนสูงและองค์ประกอบของร่างกายจะมีการเปลี่ยนแปลง
            เมื่อเด็กเจริญโตเข้าสู่วัยผู้ใหญ่
            น้ำหนักตัวเกิดจากองค์ประกอบของร่างกาย
            ซึ่งประกอบด้วยมวลไขมันและมวลปราศจากไขมัน
            มวลกล้ามเนื้อคือองค์ประกอบหลักของมวลปราศจากไขมัน
            เด็กผอมหรือเด็กที่มีดัชนีมวลกายต่ำจะมีการลดลงของทั้งมวลไขมันและมวลกล้ามเนื้อ
            ในเด็กอ้วนหรือเด็กที่มีดัชนีมวลกายสูง
            จะมีความหลากหลายขององค์ประกอบร่างกาย จะมีการเพิ่มขึ้นมวลไขมัน
            แต่มวลกล้ามเนื้อกลับมีความหลากหลาย โดยอาจมีค่าลดลง เป็นปกติ
            หรือมากกว่าปกติ นอกเหนือจากทำให้เกิดการเคลื่อนไหวของร่างกาย
            มวลกล้ามเนื้อยังมีหน้าที่เกี่ยวข้องกับการควบคุมพลังงานของร่างกายการเพิ่มขึ้นของมวลไขมัน
            การลดลงของมวลกล้ามเนื้อ อย่างใดอย่างหนึ่งหรือทั้งสองประการ
            ต่างมีผลเสียต่อสุขภาพและมีผลเสียต่อเนื่องในระยะยาวจนเข้าสู่วัยผู้ใหญ่
            อาหารและกิจกรรมทางกายคือปัจจัยหลักมีผลต่อการเปลี่ยนแปลงขององค์ประกอบของร่างกายในเด็กที่กำลังเจริญเติบโต
          </p>
        </Grid>
        <Grid item xs={12} md={6} style={{ margin: "1em" }}>
          <div className={classes.subheadText}>
            ประเมินดัชนีมวลกล้ามเนื้อสำหรับเด็กด้วยแรงบีบมือ
          </div>
          เป็นโปรแกรมที่ถูกสร้างขึ้นสำหรับใช้ในบริบทของโรงเรียนระดับประถมศึกษาและมัธยมศึกษาตอนต้น
          ที่มีเด็กนักเรียนชายหญิงอายุระหว่าง 5-16 ปี
          เพื่อใช้ในการประเมินปริมาณกล้ามเนื้อในร่างกายของเด็ก
          โดยอาศัยเพียงการวัดค่าแรงบีบมือ นอกเหนือจากค่าน้ำหนักและส่วนสูง
          โปรแกรมจะคำนวณค่าดัชนีมวลกายและดัชนีมวลกล้ามเนื้อ
          ทำให้ทราบลักษณะองค์ประกอบทางกายภาพของเด็กแต่ละคน
          การทราบค่าดัชชีมวลกายจะสามารถบ่งบอกถึงปริมาณมวลไขมันในร่างกาย
          การทราบค่าดัชนีมวลกล้ามเนื้อจะสามารถบ่งบอกถึงปริมาณมวลกล้ามเนื้อในร่างกาย
          การทราบค่าดัชนีทั้งสอง
          ทำให้สามารถให้คำแนะนำเพื่อการส่งเสริมสุขภาพเบื้องต้น
          เพื่อให้มีสุขภาพทางกายที่ดี ที่เหมาะสมกับเด็กรายบุคคล
          การให้คำแนะนำด้านอาหาร
          ด้านกิจกรรมทางกายและชนิดการออกกำลังกายที่เหมาะสมจะแตกต่างกันไปในเด็กแต่ละราย
          ทำให้สามารถการติดตามการเปลี่ยนแปลงระดับมวลกล้ามเนื้อในระยะยาว
          เพื่อใช้ในการส่งเสริมการสร้างมวลกล้ามเนื้อ
          และรักษาระดับมวลกล้ามเนื้อให้มีค่าคงที่ในเด็ก
        </Grid>
        <Grid item xs={12} md={6} style={{ margin: "1em" }}>
          <div className={classes.headText}>หลักการและเหตุผล</div>
          <ul>
            <li>
              โรงเรียนทุกแห่งจะมีการเฝ้าระวังและติดตามสุขภาพทางกายของเด็กนักเรียนเป็นประจำทุกปี
              โดยอาศัยการชั่งน้ำหนักตัว (กิโลกรัม) วัดส่วนสูง (เซนติเมตร)
              และคำนวณเป็นค่าดัชนีมวลกาย หรือน้ำหนักตัวที่ปรับด้วยค่าความสูง
              (กิโลกรัม/(เซนติเมตร/100)2)
              เพื่อใช้บ่งบอกถึงระดับการเจริญเติบโตและสภาวะโภชนาการของเด็กแต่ละคน{" "}
            </li>
            <li>
              ระดับโภชนาการของเด็กแต่ละคนจะใช้ที่ค่าดัชนีมวลกาย Z score (Body
              Mass Index, BMI Z score) โดยใช้การแปลผลดังนี้
              <ul>
                <li>น้อยกว่า -2: ผอม</li>
                <li>ระหว่าง -2 ถึง 1: ปกติ</li>
                <li>มากกว่า 1: น้ำหนักเกิน, อ้วน</li>
              </ul>
            </li>
            <li>
              น้ำหนักตัว ส่วนสูง ดัชนีมวลกาย
              จะมีการเปลี่ยนแปลงเมื่อเด็กเจริญโตเข้าสู่วัยผู้ใหญ่
              แพทย์จะใช้น้ำหนักและส่วนสูงเพื่อติดตามการเจริญเติบโต
              เฝ้าระวังภาวะทุโภชนาการของเด็ก
            </li>
            <li>
              ดัชนีมวลกายไม่เพียงพอที่จะติดตามการเจริญเติบโตของเด็ก
              เนื่องจากองค์ประกอบของร่างกาย สัดส่วนของมวลไขมันและมวลกล้ามเนื้อ
              ก็มีการเปลี่ยนแปลงเช่นกันเมื่อเด็กเจริญโตเข้าสู่วัยผู้ใหญ่
            </li>
            <li>
              น้ำหนักตัวเกิดจากองค์ประกอบของร่างกาย
              ซึ่งประกอบด้วยมวลไขมันและมวลปราศจากไขมัน
              มวลกล้ามเนื้อคือองค์ประกอบหลักของมวลปราศจากไขมัน
              เด็กผอมหรือเด็กที่มีดัชนีมวลกายต่ำจะมีการลดลงของทั้งมวลไขมันและมวลกล้ามเนื้อ
              ในเด็กอ้วนหรือเด็กที่มีดัชนีมวลกายสูง
              จะมีความหลากหลายขององค์ประกอบร่างกาย จะมีการเพิ่มขึ้นมวลไขมัน
              แต่มวลกล้ามเนื้อกลับมีความหลากหลาย โดยอาจมีค่าลดลง เป็นปกติ
              หรือมากกว่าปกติ
            </li>
            <li>
              กล้ามเนื้อลายคือเนื้อเยื่อหลักของร่างกาย
              ทำหน้าที่หลักหลากหลายประการได้แก่
              หน้าที่ด้านการเคลื่อนไหวกล้ามเนื้อลายหดและคลายตัวเพื่อเกิดการเคลื่อนไหว
              กล้ามเนื้อลายจะเปลี่ยนพลังงานเคมีจากสารอาหารเป็นพลังงานกลในรูปของแรง
              แรงทำให้กระดูกและข้อเกิดการเคลื่อนไหว
              แรงที่กระทำต่อน้ำหนักตัวผ่านข้อต่อและกระดูกจะแสดงออกมาในรูปของสมรรถนะทางกาย
              ได้แก่ ความแข็งแรง พละกำลัง ความคล่องแคล่วว่องไว ความอดทน
              และความสามารถในการเคลื่อนไหว หน้าที่ควบคุมการใช้พลังงานของร่างกาย
              กล้ามเนื้อลายความคุมระดับของพลังงานของร่างกาย
              โดยเก็บน้ำตาลเข้าสู่กล้ามเนื้อหลังมืออาหาร
              ควบคุมระดับน้ำตาลและสลายพลังงานจากเนื้อเยื่อไขมันเพื่อเป็นแหล่งพลังงานใช้ในการเคลื่อนไหวในระยะอดอาหารหรือการใช้พลังงานต่อเนื่องเวลานาน
              หน้าที่ควบคุมอุณหภูมิของร่างกายให้คงที่
              ในสภาวะปกติกล้ามเนื้อลายจะสลายพลังงานตลอดเวลาเพื่อควบคุมอุณหภูมิของร่างกายให้คงที่
            </li>
            <li>
              ปริมาณกล้ามเนื้อลายจึงสัมพันธ์กับการควบคุมน้ำหนักตัว
              หรือปริมาณมวลไขมัน
              ปริมาณมวลกล้ามเนื้อที่มากจะทำให้สุภาพทางกายและสมรรถนะทางกายที่ดี
              ปริมาณมวลกล้ามเนื้อที่น้อยและปริมาณมวลไขมันที่มากจึงสัมพันธ์กับความเจ็บป่วยจากโรคไม่ติดต่อเรื้อรัง
            </li>
            <li>
              กล้ามเนื้อลายคือเนื้อเยื่อหลักของร่างกาย
              ทำหน้าที่หลักหลากหลายประการได้แก่
              หน้าที่ด้านการเคลื่อนไหวกล้ามเนื้อลายหดและคลายตัวเพื่อเกิดการเคลื่อนไหว
              กล้ามเนื้อลายจะเปลี่ยนพลังงานเคมีจากสารอาหารเป็นพลังงานกลในรูปของแรง
              แรงทำให้กระดูกและข้อเกิดการเคลื่อนไหว
              แรงที่กระทำต่อน้ำหนักตัวผ่านข้อต่อและกระดูกจะแสดงออกมาในรูปของสมรรถนะทางกาย
              ได้แก่ ความแข็งแรง พละกำลัง ความคล่องแคล่วว่องไว ความอดทน
              และความสามารถในการเคลื่อนไหว หน้าที่ควบคุมการใช้พลังงานของร่างกาย
              กล้ามเนื้อลายความคุมระดับของพลังงานของร่างกาย
              โดยเก็บน้ำตาลเข้าสู่กล้ามเนื้อหลังมืออาหาร
              ควบคุมระดับน้ำตาลและสลายพลังงานจากเนื้อเยื่อไขมันเพื่อเป็นแหล่งพลังงานใช้ในการเคลื่อนไหวในระยะอดอาหารหรือการใช้พลังงานต่อเนื่องเวลานาน
              หน้าที่ควบคุมอุณหภูมิของร่างกายให้คงที่
              ในสภาวะปกติกล้ามเนื้อลายจะสลายพลังงานตลอดเวลาเพื่อควบคุมอุณหภูมิของร่างกายให้คงที่
            </li>
            <li>
              มวลกล้ามเนื้อจะมีค่ามากขี้นเมื่ออายุมากขึ้น
              ในเพศชายจะมีมวลกล้ามเนื้อมากกว่าเพศหญิง
              การเปลี่ยนแปลงจะเห็นชัดเมื่อเข้าสู่วัยรุ่น
              มวลกล้ามเนื้อจะมีค่าสูงสุดในวัยผู้ใหญ่และคงที่ระหว่างอายุ 19-40 ปี
              การถอดถอยหรือการเสื่อมสลายของกล้ามเนื้อตามวัยจะเกิดขึ้นเมื่ออายุมากกว่า
              40 ปี โดยมวลกล้ามเนื้อจะค่อยลดลง
              และลดลงอย่างรวดเร็วเมื่อเข้าภาวะสูงวัย
            </li>
            <li>
              เด็ก ผู้ใหญ่ ผู้สูงวัย ที่มีระดับโภชนาการ
              ระดับของกิจกรรมทางกายระดับปานกลางถึงหนัก
              และการนอนหลับที่ไม่เพียงพอ หรือในระดับต่ำ
              จะมีมวลกล้ามเนื้อในระดับต่ำ เป็นผลจากการสร้างลดลง
              การบำรุงรักษาลดลง และมีการเสื่อมสลายของมวลกล้ามเนื้อ
            </li>
            <li>
              การวัดและการเปรียบเทียบมวลกล้ามเนื้อจะใช้ค่า ดัชนีมวลกล้ามเนื้อ
              ซึ่งคือน้ำหนักมวลกล้ามเนื้อปรับค่าด้วยค่าความสูง
              (กิโลกรัม/(เซนติเมตร/100)2) ค่าระดับกล้ามเนื้อของแต่ละคน
              สามารถเปรียบเทียบกันได้
            </li>
            <li>
              ภาวะมวลกล้ามเนื้อน้อย
              คือภาวะที่ดัชนีมวลกล้ามเนื้อต่ำกว่าค่ามาตราฐาน ซึ่งคือต่ำกว่า
              ค่าเฉลี่ยของดัชนีมวลกล้ามเนื้อในเด็กที่มีอายุและเพศเดียวกันมากกว่าสองเท่าของค่าเบี่ยงเบนมาตราฐาน
              ( ต่ำกว่า ค่าเฉลี่ย-2 เท่าค่าเบี่ยงเบนมาตราฐาน)
            </li>
            <li>
              สังคมไทยได้เข้าสู่สังคมสูงวัย ผู้สูงวัยที่มีคุณภาพชีวิตที่ดี
              จะมีสุขภาพดี ไม่มีโรคไม่ติดต่อเรื้อรัง
              และคงความสามารถด้านการเคลื่อนไหวอย่างเป็นอิสระและลดการพึ่งพาจากคนรอบข้าง
              การมีคุณภาพชีวิตที่ดีในช่วงสูงวัยจะมีความสัมพันธ์กับปริมาณมวลไขมันในระดับต่ำ
              และ ปริมาณมวลกล้ามเนื้อระดับปกติหรือสูงกว่าปกติ
              การเสริมสร้างปริมาณกล้ามเนื้อ
              บำรุงรักษาระดับกล้ามเนื้อและการชะลอภาวะเสื่อมถอยของกล้ามเนื้อจึงเป็นแนวทางหลักในการเสริมสร้างสุขภาพที่ดีตลอดช่วงชีวิต
              จากวัยเด็กสู่ช่วงสูงวัย
            </li>
            <li>
              ในวัยเด็ก
              เด็กควรได้รับการสนับสนุนให้มีการเพิ่มปริมาณกล้ามเนื้อให้มีปริมาณที่มากในระดับสูงสุดเพื่อเข้าสู่วัยผู้ใหญ่
              ในช่วงวัยผู้ใหญ่ควรบำรุงรักษาระดับกล้ามเนื้อให้มีระดับคงที่
              และควรชะลอภาวะเสื่อมถอยของกล้ามเนื้อให้ช้าที่สุดเมื่อเข้าสู่ระยะสูงวัย
            </li>
            <li>
              การสนับสนุนให้มีการเพิ่มปริมาณกล้ามเนื้อให้มีปริมาณที่มากในระดับสูงสุดในเด็ก
              ภายใต้สภาวะแวดล้อมที่บ้าน โรงเรียนและการดูแลของผู้ปกครอง
              ครูที่เหมาะสม ทำได้โดยการได้รับโภชนาการเพียงพอ
              การมีระดับของกิจกรรมทางกายระดับปานกลางถึงหนัก
              และการพักผ่อนนอนหลับที่เพียงพอ
              การออกกำลังกายชนิดออกแรงต้านของกล้ามเนื้อ
              บริเวณกลางลำตัวและแขนขาจะช่วยในการเสริมสร้างมวลกล้ามเนื้อให้มีปริมาณและมีความแข็งแรง
              ส่วนการออกกำลังกายชนิดแอโรบิคจะช่วยในการใช้พลังงานของร่างกาย
              ช่วยในการลดมวลไขมันในร่างกาย
            </li>
            <li>
              การวัดมวลกล้ามเนื้อมีหลายวิธี วิธีมาตรฐานจะให้เทคนิคทางรังสี
              เป็นการวัดวิธีเดียวกับการวัดมวลกระดูกซึ่งใช้ในทางการวิจัย
              วิธีที่ง่ายในปัจจุบันคือ
              การใช้เครื่องวิเคราะห์องค์ประกอบร่างกายหรือเครื่องวิเคราะห์อิมพีแดนซ์ของไฟฟ้าชีวภาพ
              (Body Impedance Analysis) ซึ่งมีหลากหลายราคาหลายแบบ
              แบ่งตามลักษณะการใช้งานซึ่งบ่งถึงระดับความน่าเชื่อถือและความแม่นยำ
              ในเครื่องที่มีระดับความน่าเชื่อถือและความแม่นยำสูงที่ใช้ทางการแพทย์
              เครื่องดังกล่าวยังมีราคาสูง และยังไม่สามารถเข้าถึงได้ในทุกที่
            </li>
            <li>
              แรงบีบมือคือหนึ่งในองค์ประกอบของสมรรถภาพทางกายเพื่อสุขภาพ
              เครื่องวัดแรงบีบมือ จึงเป็นอีกทางเลือกในการคำนวนหามวลกล้ามเนื้อ
              โปรแกรมประเมินดัชนีมวลกล้ามเนื้อสำหรับเด็ก
              ถูกสร้างเพื่อใช้สำหรับการคำนวณและให้คำแนะนำเบื้องต้นต่อ
              บุคคลทั่วไป ผู้ปกครอง ครู แพทย์
              ที่ต้องดูและเด็กและมีความจำเป็นต้องใช้ค่ามวลกล้ามเนื้อ
              เพื่อเสริมสร้างสุขภาพที่ดี
              ในกรณีที่ไม่สามารถเข้าถึงหรือไม่มีเครื่องวิเคราะห์องค์ประกอบร่างกาย
              หรือเครื่องวิเคราะห์อิมพีแดนซ์ของไฟฟ้าชีวภาพ
              การใช้ข้อมูลจากเครื่องวัดแรงบีบมือซึ่งมีราคาถูก พร้อมข้อมูล เพศ
              ความสูงและน้ำหนักตัว สามารถนำมาใช้ในการคำนวณ
              และสามารถทำนายค่ามวลกล้ามเนื้อ ดัชนีมวลกล้ามเนื้อได้
            </li>
            <li>
              ประโยชน์ของการวัดระดับมวลกล้ามเนื้อคือ การทราบองค์ประกอบของร่างกาย
              หรือสัดส่วนของมวลไขมันและมวลกล้ามเนื้อ
              ที่ดัชนีมวลกายไม่สามารถให้คำตอบได้ ดัชนีมวลกายสามารถบอกได้ว่า
              น้ำหนักตัวปกติ น้ำหนักตัวมาก หรือ น้ำหนักตัวน้อย
              การวัดระดับมวลกล้ามเนื้อหรือดัชนีมวลกล้ามเนื้อสามารถบอกได้ว่ามวลกล้ามเนื้อปกติ
              หรือมวลกล้ามเนื้อต่ำกว่าปกติ ทำให้สามรถแบ่งเด็กออกเป็นกลุ่มย่อย
              สามารถให้คำแนะนำให้เหมาะสมมากขึ้น
            </li>
            <li>
              คำแนะนำในเด็กที่มีน้ำหนักเกินหรืออ้วน อาหารควรมีปริมาณปกติ
              แต่ลดสัดส่วนอาหารของแป้งและไขมัน
              เพิ่มกิจกรรมทางกายและลดพฤติกรรมเนือยนิ่ง
              การออกกำลังกายควรเป็นชนิดแอโรบิค
            </li>
            <li>
              คำแนะนำในเด็กที่มีมวลกล้ามเนื้อต่ำกว่าปกติ ไม่ว่าน้ำหนักตัวปกติ
              หรือมาก ควรเพิ่มสัดส่วนโปรตีนในอาหาร
              นอกเหนือจากกิจกรรมทางกายตามคำแนะนำ
              ควรเพิ่มการออกกำลังกายชนิดออกแรงต้านของกล้ามเนื้อ
              กลางลำตัวและแขนขา
            </li>
          </ul>
        </Grid>
        <Grid xs={12} md={7} item style={{ padding: "2em" }}>
          <div className={classes.subheadText}>
            การเปลี่ยนแปลงของเปอร์เซ็นต์มวลกล้ามเนื้อและดัชนีมวลกล้ามเนื้อ
            ผลจากการเจิญเติบโต จากเด็กเข้าสู่วัยรุ่น
          </div>
        </Grid>
        <Hidden only="xs">
          <Grid xs={12} md={5} container justify="center">
            <img src={grow} style={{ width: "80vw" }} />
          </Grid>
        </Hidden>
        <TableContainer component={Paper}>
          <Table aria-label="simple table">
            <TableHead>
              <TableRow>
                <TableCell align="center">เพศ</TableCell>
                <TableCell align="center">วัย</TableCell>
                <TableCell align="center">มวลกล้ามเนื้อ</TableCell>
                <TableCell align="center">ดัชนีมวลกล้ามเนื้อ</TableCell>
              </TableRow>
            </TableHead>
            <TableBody>
              <TableRow>
                <TableCell align="center">ชาย</TableCell>
                <TableCell align="center">เด็ก</TableCell>
                <TableCell align="center">78.25%</TableCell>
                <TableCell align="center">12.19</TableCell>
              </TableRow>
              <TableRow>
                <TableCell align="center">หญิง</TableCell>
                <TableCell align="center">เด็ก</TableCell>
                <TableCell align="center">76.20%</TableCell>
                <TableCell align="center">12.33</TableCell>
              </TableRow>
              <TableRow>
                <TableCell align="center">ชาย</TableCell>
                <TableCell align="center">วัยรุ่น</TableCell>
                <TableCell align="center">79.26%</TableCell>
                <TableCell align="center">15.60</TableCell>
              </TableRow>
              <TableRow>
                <TableCell align="center">หญิง</TableCell>
                <TableCell align="center">วัยรุ่น</TableCell>
                <TableCell align="center">66.93%</TableCell>
                <TableCell align="center">13.66</TableCell>
              </TableRow>
            </TableBody>
          </Table>
        </TableContainer>
        <Grid item xs={12} md={6} style={{ margin: "1em" }}>
          <ul>
            <li>
              น้ำหนักตัวของร่างกายประกอบขึ้นจาก มวลไขมันและมวลปราศจากไขมัน มวลกล้ามเนื้อเป็นองค์ประกอบส่วนใหญ่ของมวลปราศจากไขมัน และมวลอื่น ๆเช่น กระดูก เอ็น เนื้อเยื่ออื่น
            </li>
            <li>
              น้ำหนักตัวและส่วนสูงจะมีการเปลี่ยนแปลงมากขึ้นจากเด็กไปผู้ใหญ่ เป็นผลจากการเจริญเติบโต
            </li>
            <li>
              องค์ประกอบของร่างกาย
              <ul>
                <li>น้ำหนักมวลกล้ามเนื้อต่อน้ำหนักตัวประมาณ 78.25 เปอร์เซ็นต์ในเด็กชายอายุ 5-7 ปี คงที่เข้าสู่วัยรุ่นประมาณ 79.26 เปอร์เซ็นต์ในผู้ชาย</li>
                <li>น้ำหนักมวลกล้ามเนื้อต่อน้ำหนักตัวประมาณ 76.25) เปอร์เซ็นต์ในเด็กหญิงอายุ 5-7 ปี ลดลงเหลือประมาณ 66.93 เปอร์เซ็นต์ในผู้หญิง</li>
                <li>เมื่ออายุเพิ่มขึ้นในผู้หญิง น้ำหนักมวลกล้ามเนื้อต่อน้ำหนักตัวจะลดลงเกิดจากมวลไขมันเพิ่มขึ้น</li>
                <li>เพศชายมีมวลกล้ามเนื้อมากกว่าเพศหญิง เพศหญิงมีมวลไขมันมากกว่าเพศชาย เห็นชัดเมื่อเข้าวัยรุ่น %มวลกล้ามเนื้อจะลดลง</li>
                <li>ดัชนีมวลกล้ามเนื้อ ประมาณ 12.91 ในเด็กชายอายุ 5-7 ปี สูงขึ้นเมื่อเข้าสู่วัยรุ่นประมาณ 15.60</li>
                <li>ดัชนีมวลกล้ามเนื้อ ประมาณ 12.33 ในเด็กหญิงอายุ 5-7 ปี สูงขึ้นเมื่อเข้าสู่วัยรุ่นประมาณ 13.66</li>
              </ul>
            </li>
          </ul>
        </Grid>
        <Hidden only="xs">
          <Grid xs={12} md={5} container justify="center">
            <img src={growgarph} style={{ width: "80vw" }} />
          </Grid>
        </Hidden>
        <Grid xs={12} md={7} item style={{ padding: "2em" }}>
          <div className={classes.subheadText}>
            ดัชนีมวลกายต่ำ และ ดัชนีมวลกายสูง
          </div>
        </Grid>
        <Hidden only="xs">
          <Grid xs={12} md={5} container justify="center">
            <img src={bms} style={{ width: "80vw" }} />
          </Grid>
        </Hidden>
        <TableContainer component={Paper}>
          <Table aria-label="simple table">
            <TableHead>
              <TableRow>
                <TableCell align="center">ดัชนีมวลกายต่ำหรือผอม: มวลกล้ามเนื้อต่ำและมวลไขมันต่ำ</TableCell>
                <TableCell align="center">ดัชนีมวลกายสูงหรืออ้วน: มวลกล้ามเนื้อต่ำ ปกติ สูงและมวลไขมันสูง</TableCell>
              </TableRow>
            </TableHead>
          </Table>
        </TableContainer>
        <Grid item xs={12} md={6} style={{ margin: "1em" }}>
          <ul>
            <li>
              ดัชนีมวลกายคือ ค่าน้ำหนักตัวปรับด้วยค่าความสูง หรือ น้ำหนักตัว/ความสูง<sup>2</sup> กิโลกรัม/เมตร<sup>2</sup>
            </li>
            <li>
              ดัชนีมวลกายถูกใช้ในผู้ใหญ่เพื่อบ่งถึงภาวะผอมและอ้วน เนื่องจากความสูงผู้ใหญ่มีค่าคงที่
            </li>
            <li>
              การใช้ดัชนีมวลกายในเด็กมีข้อยุ่งยากและข้อจำกัด น้ำหนักตัวและส่วนสูงของเด็กจะมีการเปลี่ยนแปลงตลอดเวลาซึ่งเป็นผลจากการเจริญเติบโต โดยจะมีค่ามากขึ้นจากเด็กไปผู้ใหญ่ การเพิ่มขึ้นหรือลดลงอาจเป็นผลจากการเปลี่ยนแปลงของค่าน้ำหนักตัวหรือความสูง การแปลผลจึงต้องเปรียบเทียบกับค่าดัชนีมวลกายของเด็กที่มีอายุและเพศเดียวกัน หรือ BMI Z score
            </li>
            <li>
              ดัชนีมวลกาย Z score มักถูกใช้บ่งบอกมวลไขมัน ระดับโภชนาการ
              <ul>
                <li>น้ำหนักเกิน อ้วน จะมีดัชนีมวลกาย Z score มากกว่า +1 </li>
                <li>น้ำหนักปกติ จะมีดัชนีมวลกาย Z score ระหว่าง -2  ถึง +1 </li>
                <li>น้ำหนักน้อย ผอม จะมีดัชนีมวลกาย Z score น้อยกว่า -2 </li>
              </ul>
            </li>
            <li>
              ในความเป็นจริงมวลร่างกายประกอบด้วย มวลกล้ามเนื้อและมวลไขมัน  ดัชนีมวลกายไม่สามารถบอกองค์ประกอบร่างกายหรือสัดส่วนของมวลกล้ามเนื้อและมวลไขมัน ได้
            </li>
          </ul>
        </Grid>
        <Grid xs={12} md={7} item style={{ padding: "2em" }}>
          <div className={classes.subheadText}>
            ค่าปกติของดัชนีมวลกล้ามเนื้อ
          </div>
        </Grid>
        <Hidden only="xs">
          <Grid xs={12} md={5} container justify="center">
            <img src={mmigrow} style={{ width: "80vw" }} />
          </Grid>
        </Hidden>
        <Grid item xs={12} md={6} style={{ margin: "1em" }}>
          <ul>
            <li>
              ดัชนีมวลกายคือ ค่าน้ำหนักตัวปรับด้วยค่าความสูง หรือ น้ำหนักตัว/ความสูง<sup>2</sup> กิโลกรัม/เมตร<sup>2</sup>
            </li>
            <li>
              เพศชายจะมีดัชนีมวลกล้ามเนื้อสูงมากกว่าในเพศหญิง จะเห็นชัดเจนเมื่อเข้าสู่ระยะวัยรุ่น
            </li>
            <li>
              เด็กชาย ดัชนีมวลกล้ามเนื้อต้องมีค่าสูงกว่า
              <ul>
                <li>อายุ 5-7 ปี 11.51 </li>
                <li>อายุ 8-10 ปี 11.72</li>
                <li>อายุ 11-13 ปี 12.26</li>
                <li>อายุ 14-16 ปี 13.46</li>
              </ul>
            </li>
            <li>
              เด็กหญิง ดัชนีมวลกล้ามเนื้อต้องมีค่าสูงกว่า
              <ul>
                <li>อายุ 5-7 ปี 10.45 </li>
                <li>อายุ 8-10 ปี 10.54</li>
                <li>อายุ 11-13 ปี 11.07</li>
                <li>อายุ 14-16 ปี 11.66</li>
              </ul>
            </li>
          </ul>
        </Grid>
      
      </div>
    </>
  );
};
export default About;
